Examinator/src/Documents/ПопыткаВыполненияПодборкиВопросовСУЗ/ПопыткаВыполненияПодборкиВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПопыткаВыполненияПодборкиВопросовСУЗ</name>
  <registerRecords>InformationRegister.ТестыНаПроверкуСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВопросыТестированийСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>DefinedType.ВариантЗаданияЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>СводЗнаний</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСодержанияСводаЗнаний</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Подборка</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыполненияТеста</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговыйРезультат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <comment>Отведенное на выполнение время теста</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБалловПсихологическихВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПодборки</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПсихологическийВопрос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесВопроса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементПодборкиИзРубрикатора</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиИзРубрикатораСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыПодборки</name>
    <comment>Сохраняются группы подборки (элементы подборки верхнего уровня, которые образует ее страницы), которые были на момент начала сессии теста. В ссылках параметр numGroup</comment>
    <attributes>
      <name>ГруппаПодборки</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВсеВопросыОтвечены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВопросыНаПроверку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ/ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяПрохожденияВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЭтоТест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПопыткаЗавершена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРегистратора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВопросыТестированийСУЗ/ВопросыТестированийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВопросыТестированийСУЗ</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПодборки</name>
    <type>
      <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <dimensions>
    <name>СессияВыполненияТеста</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
      <types>DocumentRef.ПопыткаВыполненияПодборкиВопросовСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ТестыНаПроверкуСУЗ/ТестыНаПроверкуСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТестыНаПроверкуСУЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Проверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/НазначенияТестированийСУЗ/НазначенияТестированийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияТестированийСУЗ</name>
  <enumValues>
    <name>Аттестация</name>
  </enumValues>
  <enumValues>
    <name>Упражнение</name>
  </enumValues>
  <enumValues>
    <name>Анкетирование</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПопыткаВыполненияПодборкиВопросовСУЗ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Функция возвращает табличную часть ГруппыПодборки документа 
// и дополнительные данные элементов этой табличной части
//
Функция ПолучитьГруппыЭлементовПодборки() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем таблицу групп подборки
	
	ТаблГруппыПодборки = ГруппыПодборки.Выгрузить();
	
	// Колонки: ГруппаПодборки, ВсеВопросыОтвечены, Номер строки
	// И дополнительные:
	
	ТаблГруппыПодборки.Колонки.Добавить("Ссылка");
	ТаблГруппыПодборки.Колонки.Добавить("Наименование");
	ТаблГруппыПодборки.Колонки.Добавить("Код");
	ТаблГруппыПодборки.Колонки.Добавить("ЭтоГруппа");
	
	// Выбираем данные для дополнительных колонок
	
	Если ТаблГруппыПодборки.Количество() > 0 Тогда
		
		ИмяСправочника = ТаблГруппыПодборки[0].ГруппаПодборки.Метаданные().Имя;
		
		Запрос = Новый Запрос;
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("ВнешнийИсточник", ТаблГруппыПодборки);
		
		Запрос.Текст =
		"ВЫБРАТЬ ВнешнийИсточник.ГруппаПодборки КАК ГруппаПодборки
		|ПОМЕСТИТЬ ГруппыПодборки
		|ИЗ &ВнешнийИсточник КАК ВнешнийИсточник";
		
		Запрос.Выполнить();
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	"+ИмяСправочника+".Ссылка,
			|	"+ИмяСправочника+".Наименование,
			|	"+ИмяСправочника+".Код,
			|	"+ИмяСправочника+".ЭтоГруппа
			|ИЗ
			|	ГруппыПодборки КАК ГруппыПодборки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник."+ИмяСправочника+" КАК "+ИмяСправочника+"
			|		ПО ГруппыПодборки.ГруппаПодборки = "+ИмяСправочника+".Ссылка";

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		Для каждого СтрокаГП Из ТаблГруппыПодборки Цикл
			
			ВыборкаДетальныеЗаписи.Сбросить();
			ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("Ссылка", СтрокаГП.ГруппаПодборки));
			
			СтрокаГП.Ссылка       = СтрокаГП.ГруппаПодборки;
			СтрокаГП.Наименование = ВыборкаДетальныеЗаписи.Наименование;
			СтрокаГП.Код          = ВыборкаДетальныеЗаписи.Код;
			СтрокаГП.ЭтоГруппа    = ВыборкаДетальныеЗаписи.ЭтоГруппа;
			
			Если ТипЗнч(СтрокаГП.Ссылка) = Тип("СправочникСсылка.ВопросыСУЗ") Тогда
				СтрокаГП.Код = СтрокаГП.НомерСтроки;
			КонецЕсли;	
			
		КонецЦикла;
		
		ТаблГруппыПодборки.Сортировать("НомерСтроки");
			
	КонецЕсли;	
	
	// Завершаем
	
	Возврат ТаблГруппыПодборки;
	
КонецФункции

// Функция позволяет определить были ли даны ответы на все вопросы
// заданной группы. Учитываются вопросы подразделов группы.
//
// Параметры
//  СсылкаНаГруппу  – Ссылка на элемент справочника ЭлементыПодборкиСУЗ.
//
// Возвращаемое значение:
//   Булево  – Истина, если все вопросы отвечены в группе. Ложь в противном случае.
//
Функция ВсеВопросыГруппыОтвечены(СсылкаНаГруппу) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ГруппаПодборки", СсылкаНаГруппу);
	ВопросыГруппыИзТЧ = Вопросы.НайтиСтроки(ПараметрыОтбора);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Сессия", Ссылка);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ОтветНаВопросСУЗ.Ссылка) КАК Количество
	|ИЗ
	|	Документ.ОтветНаВопросСУЗ КАК ОтветНаВопросСУЗ
	|ГДЕ
	|	ОтветНаВопросСУЗ.СессияВыполненияТеста = &Сессия
	|   И ОтветНаВопросСУЗ.Отменено = ЛОЖЬ
	|   И ОтветНаВопросСУЗ.ВопросОтвечен = ЛОЖЬ
	|";
	
	Если ВопросыГруппыИзТЧ.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + " И (";
		НомерВопроса = 1;
		Для каждого ВопросТЧ Из ВопросыГруппыИзТЧ Цикл
			ТекстЗапроса = ТекстЗапроса + " ОтветНаВопросСУЗ.Вопрос = &Вопрос" + НомерВопроса + " ИЛИ";
			Запрос.УстановитьПараметр("Вопрос"+НомерВопроса, ВопросТЧ.Вопрос);
			НомерВопроса = НомерВопроса + 1;
		КонецЦикла;
		ТекстЗапроса = Сред(ТекстЗапроса, 1, СтрДлина(ТекстЗапроса)-3);
		ТекстЗапроса = ТекстЗапроса + " )";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Если РезультатЗапроса.Количество = 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ПолучитьКоличествоОтвеченныхВопросовГруппы()

// Функция позволяет определить есть ли вопросы в группе,
// которые требуют проверки. Учитываются вопросы подразделов группы.
//
// Параметры
//  СсылкаНаГруппу  – Ссылка на элемент справочника ЭлементыПодборкиСУЗ.
//
// Возвращаемое значение:
//   Булево  – Истина, если есть вопросы для проверки. Ложь в противном случае.
//
Функция ВопросыГруппыТребуютПроверки(СсылкаНаГруппу) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ГруппаПодборки", СсылкаНаГруппу);
	ВопросыГруппыИзТЧ = Вопросы.НайтиСтроки(ПараметрыОтбора);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Сессия", Ссылка);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ОтветНаВопросСУЗ.Ссылка) КАК Количество
	|ИЗ
	|	Документ.ОтветНаВопросСУЗ КАК ОтветНаВопросСУЗ
	|ГДЕ
	|	ОтветНаВопросСУЗ.СессияВыполненияТеста = &Сессия
	|   И ОтветНаВопросСУЗ.ПроверяетсяПреподавателем = ИСТИНА
	|   И ОтветНаВопросСУЗ.Отменено = ЛОЖЬ
	|   И ОтветНаВопросСУЗ.ПроверенПреподавателем = ЛОЖЬ
	|";
	
	Если ВопросыГруппыИзТЧ.Количество() > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + " И (";
		НомерВопроса = 1;
		Для каждого ВопросТЧ Из ВопросыГруппыИзТЧ Цикл
			ТекстЗапроса = ТекстЗапроса + " ОтветНаВопросСУЗ.Вопрос = &Вопрос" + НомерВопроса + " ИЛИ";
			Запрос.УстановитьПараметр("Вопрос"+НомерВопроса, ВопросТЧ.Вопрос);
			НомерВопроса = НомерВопроса + 1;
		КонецЦикла;
		ТекстЗапроса = Сред(ТекстЗапроса, 1, СтрДлина(ТекстЗапроса)-3);
		ТекстЗапроса = ТекстЗапроса + " )";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Если РезультатЗапроса.Количество > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

// Функция позволяет определить были ли даны ответы на все вопросы теста.
//
// Параметры
//  Нет
//
// Возвращаемое значение:
//   Булево  – Истина, если все вопросы отвечены. Ложь в противном случае.
//
Функция ВсеВопросыТестаОтвечены() Экспорт
	
	Для каждого Строка Из ГруппыПодборки Цикл

		Если НЕ Строка.ВсеВопросыОтвечены Тогда
			Возврат Ложь;
		КонецЕсли;

	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// В данной процедуре пересчитываются следующие реквизиты:
//  - ИтоговыйРезультат
//  - СуммаБалловПсихологическихВопросов
//  - ПроверяетсяПреподавателем
//  - ПроверенПреподавателем
//  В оперативном режиме:
//  - ВремяВыполненияТеста
//  - ТестЗавершен
//  - Дата
//
Процедура ЗакрытьСессию(Оперативно=Ложь) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если Оперативно Тогда
		
		// Определяем время, сколько уже выполняется тест
		ВыполняетсяТест = ТекущаяДата() - ДатаНачалаВыполненияТеста;
		ВыполняетсяТестМинут = Цел(ВыполняетсяТест/60);
		ВыполняетсяТестСекунд = ВыполняетсяТест - ВыполняетсяТестМинут*60; 
		ВыполняетсяТестЧасов = Цел(ВыполняетсяТестМинут/60);
		ВыполняетсяТестМинут = ВыполняетсяТестМинут - ВыполняетсяТестЧасов*60;
		
		Если ВыполняетсяТестЧасов >= 24 Тогда
			ВыполняетсяТестЧасов = 23;
			ВыполняетсяТестМинут = 59;
			ВыполняетсяТестСекунд = 59;
		КонецЕсли;
		
		Если ВыполняетсяТестЧасов < 24 Тогда
			ВремяВыполненияТеста = Дата(0001,01,01,ВыполняетсяТестЧасов,ВыполняетсяТестМинут,ВыполняетсяТестСекунд);
		КонецЕсли;
						
		ТестЗавершен = Истина;
		Дата = ТекущаяДата();
		
	КонецЕсли;
	
	// Находим максимальное количество баллов
	
	МаксимальноеКоличествоБаллов        = 0;
	КоличествоНеПсихологическихВопросов = 0;
	
	Для каждого ЭлементТЧ Из Вопросы Цикл
	
		Если НЕ ЭлементТЧ.ПсихологическийВопрос Тогда
			МаксимальноеКоличествоБаллов        = МаксимальноеКоличествоБаллов + (100*ЭлементТЧ.ВесВопроса);
			КоличествоНеПсихологическихВопросов = КоличествоНеПсихологическихВопросов + 1;
		КонецЕсли;
	
	КонецЦикла;
	
	// Выбираем данные об ответах пользователя на вопросы.
	
    // Примечание: если в тесте нет не психологических вопросов, то
	// Результат будет равен всегда 100.
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ОтветНаВопросСУЗ.Результат КАК Результат,
	               |	ОтветНаВопросСУЗ.ПроверяетсяПреподавателем КАК ПроверяетсяПреподавателем,
	               |	ОтветНаВопросСУЗ.ПроверенПреподавателем КАК ПроверенПреподавателем,
	               |	ОтветНаВопросСУЗ.БаллЗаПсихологическийВопрос КАК БаллЗаПсихологическийВопрос,
	               |	ОтветНаВопросСУЗ.ПсихологическийВопрос КАК ПсихологическийВопрос,
	               |	ОтветНаВопросСУЗ.Вопрос КАК Вопрос
	               |ИЗ
	               |	Документ.ОтветНаВопросСУЗ КАК ОтветНаВопросСУЗ
	               |ГДЕ
	               |	ОтветНаВопросСУЗ.СессияВыполненияТеста = &Сессия
	               |	И ОтветНаВопросСУЗ.ВопросОтвечен = ИСТИНА
	               |	И ОтветНаВопросСУЗ.Отменено = ЛОЖЬ";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Сессия", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	СуммаБаллов = 0;
	ПроверяетсяПреподавателем = Ложь;  // Реквизит
	ПроверенПреподавателем = Истина;  // Реквизит
	СуммаБалловПсихологическихВопросов  = 0; // Реквизит
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		СтрокаТЧВопросы = Вопросы.Найти(РезультатЗапроса.Вопрос, "Вопрос");
		
		Если СтрокаТЧВопросы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВесВопроса = СтрокаТЧВопросы.ВесВопроса;
		
		СуммаБаллов = СуммаБаллов + (ВесВопроса*РезультатЗапроса.Результат);
		
		Если РезультатЗапроса.ПроверяетсяПреподавателем Тогда
			
			ПроверяетсяПреподавателем = Истина;  // Реквизит
			
		КонецЕсли;
		
		Если РезультатЗапроса.ПроверяетсяПреподавателем
			И НЕ РезультатЗапроса.ПроверенПреподавателем Тогда
			
			ПроверенПреподавателем = Ложь;  // Реквизит
			
		КонецЕсли;
		
		Если РезультатЗапроса.ПсихологическийВопрос Тогда
			// Реквизит
			СуммаБалловПсихологическихВопросов = СуммаБалловПсихологическихВопросов + РезультатЗапроса.БаллЗаПсихологическийВопрос;  // Реквизит
		КонецЕсли;
		
	КонецЦикла;
	
	Если НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Анкетирование Тогда
		
		ПроверяетсяПреподавателем = Ложь;
		ПроверенПреподавателем = Ложь;
		
	Иначе		
		
		Если НЕ ПроверяетсяПреподавателем Тогда
			ПроверенПреподавателем = Ложь;  // Реквизит
		КонецЕсли;
		
	КонецЕсли;
		
	Если КоличествоНеПсихологическихВопросов = 0 Тогда
		
		ИтоговыйРезультат = 100;  // Реквизит
		
	Иначе
		
		Если МаксимальноеКоличествоБаллов <= 0 Тогда
			ИтоговыйРезультат = 0;  // Реквизит
		Иначе
			ИтоговыйРезультат = Окр((СуммаБаллов / МаксимальноеКоличествоБаллов)*100);  // Реквизит	
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Записывать = Истина;
	Движения.ВопросыТестированийСУЗ.Записывать = Истина;
	Движения.ТестыНаПроверкуСУЗ.Записывать = Истина;

	Если ЭлектронныеРесурсыПереопределяемый.ОбучениеОтменено(Отменено, ПрохождениеОбучения, Задание) Тогда
		Возврат;
	КонецЕсли;
	
	// Движение по регистру ПопыткиПрохожденияЭлектронныхРесурсовСУЗ

	Движение = Движения.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ.Добавить();
	Движение.Период                    = Дата;
	Движение.Пользователь              = Пользователь;
	Движение.ЭлементСодержания         = ЭлементСодержанияСводаЗнаний;
	Движение.ПрохождениеОбучения       = ПрохождениеОбучения;
	Движение.Задание                   = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, СводЗнаний, Задание);
	Движение.Результат                 = ИтоговыйРезультат;
	Движение.ВремяПрохожденияВСекундах = Дата - ДатаНачалаВыполненияТеста;
	Движение.ЭлектронныйРесурс         = СводЗнаний;
	Движение.СсылкаНаОбъектСУЗ         = Подборка;
	Движение.ПопыткаЗавершена          = ТестЗавершен;
	Движение.ДатаНачалаПрохождения     = ДатаНачалаВыполненияТеста;
	Движение.ДатаОкончанияПрохождения  = Дата;
	Движение.ЭтоТест                   = Истина;
	Движение.НомерРегистратора         = Номер;
	
	НазначениеТестирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подборка, "НазначениеТестирования");
	
	Если НазначениеТестирования = Перечисления.НазначенияТестированийСУЗ.Аттестация Тогда
		Движение.ВыставляетсяОценка = Истина;
	Иначе
		Движение.ВыставляетсяОценка = Ложь;
	КонецЕсли;
		
	Движение.ПроверяетсяПреподавателем = ПроверяетсяПреподавателем;
	Движение.ПроверенПреподавателем    = ПроверенПреподавателем;
	Движение.Сложность                 = Сложность;
	Движение.ЗавершеноВПроцентах       = ?(ТестЗавершен, 100, 0);
	
	ЭлектронныеРесурсыПереопределяемый.ПроведениеОбучения(Движение.ПроведениеОбучения, ПрохождениеОбучения);
	
	// Движение по регистру ВопросыТестированийСУЗ
	
	Для каждого Строка Из Вопросы Цикл
	
		Движение = Движения.ВопросыТестированийСУЗ.Добавить();
		
		Движение.СессияВыполненияТеста = Ссылка;
		Движение.Вопрос = Строка.Вопрос;
		Движение.Вес = Строка.ВесВопроса;
		Движение.ГруппаПодборки = Строка.ГруппаПодборки;
		
	КонецЦикла;
	
	// Движение по регистру ТестыНаПроверкуСУЗ
	
	Если ПроверяетсяПреподавателем Тогда
		
		Движение = Движения.ТестыНаПроверкуСУЗ.Добавить();
		
		Движение.Период = Дата;
		Движение.Пользователь = Пользователь;
		Движение.ПрохождениеОбучения = ПрохождениеОбучения;
		Движение.Задание = ОбъектыСУЗ.ЗаданиеПопытки(ПрохождениеОбучения, СводЗнаний, Задание);
		Движение.ЭлементСодержания = ЭлементСодержанияСводаЗнаний;
		Движение.Тест = Подборка;
		
		Движение.Проверен = ПроверенПреподавателем;
		Движение.ЭлектронныйРесурс = СводЗнаний;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
